test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@

#+bibliography: cite/bib/orgcite.bib

#+author:

** DONE Parsing notes from LOGBOOK                   :notes:logbook:noexport:
:PROPERTIES:
:EXPORT_FILE_NAME: parsing-notes-from-logbook
:LOG_INTO_DRAWER: t
:LOGGING: TODO(!) DRAFT(!) DONE(!)
:EXPORT_OPTIONS: d:t
:END:
:LOGBOOK:
- Note taken on [2018-09-06 Thu 11:45] \\
  Another note.
- Note taken on [2018-09-06 Thu 11:37] \\
  A note
- State "DONE"       from "DRAFT"      [2018-09-06 Thu 11:25]
- State "DRAFT"      from "TODO"       [2018-09-06 Thu 11:25]
- State "TODO"       from              [2018-09-06 Thu 11:25]
:END:
#+begin_description
Parse notes from LOGBOOK into a TOML table (YAML map?) of ~notes~
front-matter.
#+end_description

{{{oxhugoissue(203)}}}

For example,

#+begin_src org
:LOGBOOK:
- Note taken on [2018-09-06 Thu 11:45] \\
  Another note.
- Note taken on [2018-09-06 Thu 11:37] \\
  A note
- State "DONE"       from "DRAFT"      [2018-09-06 Thu 11:25]
- State "DRAFT"      from "TODO"       [2018-09-06 Thu 11:25]
- State "TODO"       from              [2018-09-06 Thu 11:25]
:END:
#+end_src

should export these ~notes~ in TOML front-matter (and the equivalent
in YAML):
#+begin_src toml
[[notes]]
  index = 0
  date = 2018-09-06T11:37:00-04:00
  content = "A note."
[[notes]]
  index = 1
  date = 2018-09-06T11:45:00-04:00
  content = "Another note."
#+end_src

- Note :: The state change notes are intentionally put in this test
          LOGBOOK, because we want to ensure that they don't seep into
          the ~notes~ front-matter.
